app/views/topics/show.html.erb


<% if @topic.comments.any? %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."topic_id" = 20