app/controllers/comments_controller.rb

  def create
    @topic=Topic.find(params[:topic_id])
    @comment=@topic.comments.build(:content => params[:comment][:content])
    @comment.user=current_user
    if @comment.save
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "20"]]
INSERT INTO "comments" ("content", "created_at", "topic_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "asdfsdsdf"], ["created_at", Mon, 12 Nov 2012 14:11:40 UTC +00:00], ["topic_id", 20], ["updated_at", Mon, 12 Nov 2012 14:11:40 UTC +00:00], ["user_id", 11]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
    @topic=Topic.find(params[:topic_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "25"]]