app/controllers/home_controller.rb

  def index
    @nodes = Node.all
---
SELECT "nodes".* FROM "nodes"