app/controllers/topics_controller.rb

SELECT "nodes".* FROM "nodes" WHERE "nodes"."id" IN (1, 2, 3)
SELECT "topics".* FROM "topics" ORDER BY topics.updated_at desc LIMIT 5 OFFSET 0
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 10, 11, 12)
SELECT COUNT(*) FROM "topics"
---
  def index
    page = params[:page]
    @topics = Topic.paginate(:page=>page,:per_page=>5)
                   .includes(:node).includes(:user)
                   .order("topics.updated_at desc")

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "rails"]]
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = 20
---
  def show
    @topic = Topic.find(params[:id])
    @comment_latest=@topic.comments.order("comments.updated_at desc").first

SELECT "nodes".* FROM "nodes" WHERE "nodes"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "topics".* FROM "topics" WHERE "topics"."node_id" = 1 ORDER BY topics.updated_at desc LIMIT 5 OFFSET 0
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 11, 12)
SELECT COUNT(*) FROM "topics" WHERE "topics"."node_id" = 1
---
  def node
    page=params[:page]
    @node = Node.find(params[:id])
    @topics = @node.topics.includes(:user).paginate(:page=>page,:per_page=>5)
                   .order("topics.updated_at desc")

SELECT "nodes".* FROM "nodes"
---
  def new
    @topic = Topic.new
    @nodes = Node.all

SELECT "nodes".* FROM "nodes" WHERE "nodes"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "topics" ("content", "created_at", "node_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "asdfasdfasdf"], ["created_at", Sun, 11 Nov 2012 12:35:19 UTC +00:00], ["node_id", 1], ["title", "asdfsadf"], ["updated_at", Sun, 11 Nov 2012 12:35:19 UTC +00:00], ["user_id", 11]]
SELECT "nodes".* FROM "nodes"
---
  def create

    @node = Node.find(params[:topic][:node_id])
    @topic = @node.topics.build(:title => params[:topic][:title],
                                :content => params[:topic][:content])
    @topic.user_id = current_user.id
    if @topic.save
      flash[:notice] = "add topic successful"
      redirect_to topic_path @topic

    else
      @nodes = Node.all

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "22"]]
SELECT "nodes".* FROM "nodes"
---
  def edit
    @topic = Topic.find(params[:id])
    @nodes = Node.all

SELECT "nodes".* FROM "nodes" WHERE "nodes"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "23"]]
UPDATE "topics" SET "title" = 'ruby topic 1sdf', "content" = 'ruby topic 1safasf', "node_id" = 3, "updated_at" = '2012-11-12 05:00:24.580495' WHERE "topics"."id" = 24
SELECT "nodes".* FROM "nodes"
---
  def update
    @node=Node.find(params[:topic][:node_id])
    @topic=Topic.find(params[:id])
    @topic.title=params[:topic][:title]
    @topic.content=params[:topic][:content]
    @topic.node=@node

    if @topic.save
      flash[:notice]="update topic successful"
      redirect_to topic_path @topic
    else
      @nodes=Node.all

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "9"]]
---
  def destroy
    @topic = Topic.find(params[:id])