app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user= User.new(params[:user])

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "users" SET "username" = 'vvvvvvvv', "email" = 'vv@123.com', "updated_at" = '2012-11-13 04:51:16.664960' WHERE "users"."id" = 29
---
  def update
    @user=User.find(params[:id])

#    @user.email=params[:user][:email]
#    @user.username=params[:user][:username]
#    if @user.update_attribute(:username, params[:user][:username])


    if @user.update_attributes(params[:user])